app/controllers/users/devise/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "alvin@smith.com"], ["LIMIT", 1]]
---
  def create
    @user = User.find_by_email(user_params[:email])