app/controllers/orders_controller.rb

  def index
    render json: Order.all
---
SELECT "orders".* FROM "orders"

  def create
    order = Order.create!(order_params)
---
INSERT INTO "orders" ("sender_name", "receiver_name", "nature_of_goods", "pickup", "destination", "use_profile_id", "created_at", "updated_at", "senderName", "receiverName", "amountPaid", "natureOfGoods") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    order = find_order
    order.update!(order_params)
---
UPDATE "orders" SET "updated_at" = ?, "receiverName" = ? WHERE "orders"."id" = ?  [["updated_at", "2022-11-04 10:43:02.055128"], ["receiverName", "Bofulo"], ["id", 2]]

  def destroy
    order = find_order
    order.destroy
---
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 1]]

  def find_order
    Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]