app/controllers/receipts_controller.rb

  def index
    receipts = Receipt.all
---
SELECT "receipts".* FROM "receipts"

  def show
    receipt = Receipt.find(params[:id])
---
SELECT "receipts".* FROM "receipts" WHERE "receipts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @receipt = Receipt.create!(receipt_params)
---
INSERT INTO "receipts" ("receipt_no", "sender_name", "receiver_name", "amount_paid", "nature_of_goods", "pickup", "destination", "order_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)