app/controllers/use_profiles_controller.rb

        def index
            user_profiles = UseProfile.all
---
SELECT "use_profiles".* FROM "use_profiles"

        def create
            user_profile = UseProfile.create!(user_profile_params)
---
INSERT INTO "use_profiles" ("avatar", "telephone", "location", "user_id", "created_at", "updated_at", "firstName", "lastName") VALUES (?, ?, ?, ?, ?, ?, ?, ?)