app/controllers/user_profiles_controller.rb

SELECT "user_profiles".* FROM "user_profiles"
---
        def index
            profiles = UserProfile.all

INSERT INTO "user_profiles" ("firstName", "lastName", "location", "telephone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["firstName", "Zamzam"], ["lastName", "Hassan"], ["location", "nairnn"], ["telephone", "Hassan"], ["created_at", "2022-11-04 10:36:51.298028"], ["updated_at", "2022-11-04 10:36:51.298028"]]
---
        def create
            userprofile = UserProfile.create!(user_params)